In [2]:
import numpy as np;

import pandas as pd;

In [3]:
my_list = [10,25,35]

x = np.array(my_list)

In [4]:
pd.Series(my_list)

0    10
1    25
2    35
dtype: int64

In [5]:
index_values = ['B', 'C', 'D']

Series_one = pd.Series(data = my_list, index = index_values)

In [6]:
index_values_2 = ['B', 'C', 'F']
my_list_2 = [10,25,40]

Series_two = pd.Series(data = my_list_2, index = index_values_2)

In [7]:
total = Series_one + Series_two

In [8]:
total

B    20.0
C    50.0
D     NaN
F     NaN
dtype: float64

In [9]:
total[['B','C']]

B    20.0
C    50.0
dtype: float64

In [11]:
df = pd.DataFrame({'Series 1': Series_one, 'Series 2': Series_two})

In [12]:
df

   Series 1  Series 2
B      10.0      10.0
C      25.0      25.0
D      35.0       NaN
F       NaN      40.0

In [15]:
ice_cream = [['A', 1], ['B', 2], ['C', 3]]

df_2 = pd.DataFrame(data=ice_cream, index=['Flavor 1', 'Flavor 2', 'Flavor 3'], columns = ('Flavor', 'Scoops'))

df_2

         Flavor  Scoops
Flavor 1      A       1
Flavor 2      B       2
Flavor 3      C       3

In [19]:
import mysql.connector

In [21]:
connection = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'thats funny',
    database = 'parks_and_recreation'
)

In [25]:
query = 'SELECT * FROM parks_and_recreation.employee_salary'

pd.read_sql(query, connection)

C:\Users\Stichting GeoFort\AppData\Local\Temp\ipykernel_12600\4218354082.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, connection)

,employee_id,first_name,last_name,occupation,salary,dept_id
0,1,Leslie,Knope,Deputy Director of Parks and Recreation,75000,1.0
1,2,Ron,Swanson,Director of Parks and Recreation,70000,1.0
2,3,Tom,Haverford,Entrepreneur,50000,1.0
3,4,April,Ludgate,Assistant to the Director of Parks and Recreation,25000,1.0
4,5,Jerry,Gergich,Office Manager,50000,1.0
5,6,Donna,Meagle,Office Manager,60000,1.0
6,7,Ann,Perkins,Nurse,55000,4.0
7,8,Chris,Traeger,City Manager,90000,3.0
8,9,Ben,Wyatt,State Auditor,70000,6.0
9,10,Andy,Dwyer,Shoe Shiner and Musician,20000,NaN
10,11,Mark,Brendanawicz,City Planner,57000,3.0
11,12,Craig,Middlebrooks,Parks Director,65000,1.0
12,13,Kevin,De Vries,Mechanic,53000,NaN